import Rule from "../rules/Rule";

const Challenge = () => {
  const rules = [
    "نوض قبل 5: الهدف انك تنوض بوعيك وتتفكر بلي عندك تحدي وطريق وخدمة تستنا فيك، لازم تنوض من الفراش مباشرة بعدما تتفكر، منبعد تقدر تعاود ترقد",
    "صور التحسن: كل يوم تصور روحك ووين وصلت، باش تعرف شحال تبدلت (تصاور متشاركهمش معانا)",
    "نظم وقتك: تعلم تنظيم يومك لتحقيق أقصى إنتاجية، وأفضل طريقة لذلك هي timeboxing",
    "دير يومية: كل يوم اكتب وش درت فنهار، كون 1% خيرمن لبارح",
    "لا عجين لا غاز: ممنوع لأسبوع كامل اي عجائن ولا اكل سريع ولا مشروبات، فقط طياب الدار الصحي و الماء بكثرة",
    "اقرا : كل يوم عندك على الاقل 5 صفحات من كتاب يعملك , مشي قصة",
    "حرية عقلية: مكانش تلفون ساعة لولة والأخيرة من كل يوم بش تحافظ على انتاجيتك",
    "الإمتنان: اكتب رسالة شكر كل يوم لربي ولا للناس -خليها عندك- تشكر فيها نعمة جديدة مهما كانت",
    "ضع خطة: لازم تدير اهداف و خطة للشهر القادم وش راح تدير فيه خدمة وتعرف وين راك رايح",
    "تحكم فروحك: اختار نهار من الأسبوع متخدمش بتلفون 24 ساعة مهما كان السبب",
    "تحرك: دير رياضة 3 خطرات على الاقل فالاسبوع، وين تقدر الحصة تكون ربع ساعة -للبنات- ولا اخرج امشي",
    "ركز: في هذا الاسبوع اختار حاجة تركز تتعلمها ساعة على الاقل كل يوم",
    "القبطان يدعم خوه: لازم تقنع واحد تعرفو يدخل التحدي",
  ];
  return (
    <>
      <div className="p-10 bg-black text-white flex flex-col text-end w-full h-full ">
        <h1 className="text-4xl pt-16 pb-5 font-bold">Algeria 2024</h1>
        <p className=" text-center pb-8">
          هو تحدي لمدة أسبوع لي من خلالو تثبث لروحك ولأعضاء النادي مدى إصرارك
          على تطوير نفسك ونمط حياتك، وهذا ما يسمحلك تدخل المجموعة الخاصة وتكمل
          تحدي 5 أشهر لي منو راح تنال كل الفرص لي تستاهلها باش توصل وين راك حاب
        </p>
        <p className="text-2xl pb-3 font-semibold">القواعد</p>
        {rules.map((rule, i) => (
          <Rule key={i} numberOfRule={i + 1} rule={rule} />
        ))}
        <button className="self-end mt-8 p-4 pv-2 rounded-md flex items-center justify-center  border-solid border-2 border-[#473c89]  hover:bg-[#473c89] focus:bg-[#584bac]">
          <p>كيفية التسجيل هنا</p>
        </button>
        <p className="pt-8 ">Discord التحدي يقام في تطبيق</p>
        <p className="pt-3 ">عليك تحميله. تجد فديو إرشادي أسفل الصفحة..</p>
        <p className="pt-3 ">
          JOIN-TFC تدخل إليها، ثم بعد قراءتك للوصف تضغط على إستمارة بدأ
        </p>
        <p className="pt-3 ">
          التحدي حتى يتم تسجيلك في المشاركين ثم إضغط على -إبدأ التحدي- والذي
          يأخذك إلى غرفتك الخاصة لإجراء التحدي. أي ستقوم بكتابة اسمك الكامل
          وعناونك البريدي email
        </p>
        <p className="pt-3 ">
          ويبدأ عد الأيام - يمكنك بدأ التحدي متى شئت - بتطبيقك لقواعد التحدي
          يترتب عليك مشاركة تقدمك في إنجازها كمشاركة اليومية مع إنتهاء كل نهار.
          وكذا إرسالك رسالة يومية قبل 5 صباحا لإثبات حضورك. بعد إنهائك التحدي
          تقوم بملء إستمارة تجدها في غرفة join-tfc# حتى تعلم المسؤول عن إنتهائك
          ويتم مراجعة نتائجك. طريقة تقييم النتائج تختلف من مشارك لآخر. المهم أن
          على كل شخص تقديم كل ما لديه. وفي حالة فشلك يطلب منك إعادة التحدي إذا
          كنت حقا لاتزال راغبا في تغيير حياتك. لا توجد أي تساهلات في تقييم
          التحدي وداخل المجموعة. بعد أن يتم قبولك في المجموعة سيعرض عليك شرح
          مفصل عن المجموعة الخاصة وكذا القواعد العامة لها حتى تستطيع فهم كيفية
          سير الأمور.
        </p>
        <p className="pt-8 font-bold text-xl font-sans ">
          One DAY or Day One !
        </p>
        <button className="self-end mt-2 p-2 rounded-md flex pv-1 items-center justify-center  border-solid border-1 border-[#473c89]  bg-[#473c89] focus:bg-[#584bac] font-bold font-mono hover:bg-transparent ">
          Discord
        </button>
        <p></p>
      </div>
    </>
  );
};

export default Challenge;
